app/controllers/abouts_controller.rb

  def index
    @abouts = About.all
---
SELECT * FROM "abouts" ORDER BY abouts.id DESC LIMIT 1

  def show
    @about = About.find(params[:id])
---
SELECT * FROM "abouts" WHERE ("abouts"."id" = 1)

  def edit
    @about = About.last
---
SELECT * FROM "abouts" ORDER BY abouts.id DESC LIMIT 1

  def create
    @about = About.new(params[:about])

    respond_to do |format|
      if @about.save
---
INSERT INTO "abouts" ("created_at", "updated_at", "content") VALUES('2009-12-18 20:29:33', '2009-12-18 20:29:33', '<h2>Overview</h2>

  def update
    @about = About.find(params[:id])

    if (params[:secret_key].nil?) then
      @about.errors.add(:base, "Missing secret key")
      render :action => "edit", :layout => 'application'
      return
    end

    if (params[:secret_key] != ATC_SECRET_KEY)
      @about.errors.add(:base, "Wrong secret key")
      render :action => "edit", :layout => 'application'
      return
    end

    respond_to do |format|
      if @about.update_attributes(params[:about])
---
SELECT * FROM "abouts" WHERE ("abouts"."id" = 1)
UPDATE "abouts" SET "updated_at" = '2009-12-18 20:54:34', "content" = '<h2>Overview1</h2>