app/controllers/athletes_controller.rb

SELECT * FROM "athletes"
---
  def index
    @athletes = Athlete.all

SELECT * FROM "athletes"
---
  def index_admin
    @athletes = Athlete.all

SELECT * FROM "athletes" WHERE ("athletes"."id" = 1)
---
  def show
    @athlete = Athlete.find(params[:id])

SELECT * FROM "athletes" WHERE ("athletes"."id" = 2)
---
  def edit
    @athlete = Athlete.find(params[:id])

INSERT INTO "athletes" ("name", "created_at", "updated_at", "photo_url", "primary_sports", "content", "hometown") VALUES('John Wright', '2010-01-17 00:44:55', '2010-01-17 00:44:55', 'http://photos-b.ak.fbcdn.net/hphotos-ak-snc3/hs072.snc3/13937_384361000234_331358835234_10339712_1749395_n.jpg', 'Trail running, biking', 'I am an athlete', 'Boulder, CO')
---
  def create
    @athlete = Athlete.new(params[:athlete])

    respond_to do |format|
      if @athlete.save

SELECT * FROM "athletes" WHERE ("athletes"."id" = 1)
UPDATE "athletes" SET "updated_at" = '2010-01-18 00:56:42', "content" = 'When I discovered Connie''s workouts I knew that my fitness would change in fundamental way if I stuck with it. I did and soon I put on lots of lean muscle, increased my endurance and flexibility and and improved my trail running race times. I view what I do at ATC as the foundation for everything I do in sports and out in the mountains and I think most every other athlete does too. It''s hard to argue with success and I have met with a lot of it at ATC.' WHERE "id" = 1
---
  def update
    @athlete = Athlete.find(params[:id])

    respond_to do |format|
      if @athlete.update_attributes(params[:athlete])