app/controllers/home_controller.rb

SELECT * FROM "media_profiles" ORDER BY media_profiles.id DESC LIMIT 1
INSERT INTO "media_profiles" ("created_at", "title", "updated_at", "link") VALUES('2009-12-16 22:01:26', 'Rob Coppolillo - Goin Heavy', '2009-12-16 22:01:26', 'http://photos-a.ak.fbcdn.net/hphotos-ak-snc3/hs052.snc3/13937_376548240234_331358835234_10291186_1926195_n.jpg')
---
  def index
    @media_profile = MediaProfile.last
      if @media_profile.nil? then
        @media_profile = MediaProfile.new
        @media_profile.save

SELECT * FROM "abouts" ORDER BY abouts.id DESC LIMIT 1
INSERT INTO "abouts" ("created_at", "updated_at", "content") VALUES('2009-12-19 15:27:05', '2009-12-19 15:27:05', NULL)
---
  def about
    @about = About.first
     if @about.nil? then
          @about = About.new
          @about.save

SELECT * FROM "workouts" ORDER BY created_at desc
---
  def training
    @workouts = Workout.all