app/controllers/media_profiles_controller.rb

  def index
    @media_profiles = MediaProfile.all
---
SELECT * FROM "media_profiles"

  def show
    @media_profile = MediaProfile.find(params[:id])
---
SELECT * FROM "media_profiles" WHERE ("media_profiles"."id" = 1)

  def edit
    @media_profile = MediaProfile.first
    if @media_profile.nil? then
      @media_profile = MediaProfile.new
      @media_profile.save
---
SELECT * FROM "media_profiles" ORDER BY media_profiles.id DESC LIMIT 1
INSERT INTO "media_profiles" ("created_at", "title", "updated_at", "link") VALUES('2009-12-19 14:35:54', NULL, '2009-12-19 14:35:54', NULL)

  def create
    @media_profile = MediaProfile.new(params[:media_profile])

    respond_to do |format|
      if @media_profile.save
---
INSERT INTO "media_profiles" ("created_at", "title", "updated_at", "link") VALUES('2009-12-16 21:48:18', 'Rob Coppolillo - Goin'' Heavy', '2009-12-16 21:48:18', 'http://photos-a.ak.fbcdn.net/hphotos-ak-snc3/hs052.snc3/13937_376548240234_331358835234_10291186_1926195_n.jpg')

  def update

    @media_profile = MediaProfile.find(params[:id])

    if (params[:secret_key].nil?) then
      @media_profile.errors.add(:base, "Missing secret key")
      render :action => "edit", :layout => 'application'
      return
    end

    if (params[:secret_key] != ATC_SECRET_KEY)
      @media_profile.errors.add(:base, "Wrong secret key")
      render :action => "edit", :layout => 'application'
      return
    end

    respond_to do |format|
      if @media_profile.update_attributes(params[:media_profile])
---
SELECT * FROM "media_profiles" WHERE ("media_profiles"."id" = 2)
UPDATE "media_profiles" SET "updated_at" = '2009-12-19 14:36:34', "title" = 'swing', "link" = 'http://photos-f.ak.fbcdn.net/hphotos-ak-snc3/hs072.snc3/13937_380095560234_331358835234_10315220_5617473_n.jpg' WHERE "id" = 1

  def destroy
    @media_profile = MediaProfile.find(params[:id])
    @media_profile.destroy
---
SELECT * FROM "media_profiles" WHERE ("media_profiles"."id" = 1)
DELETE FROM "media_profiles" WHERE "id" = 1