app/controllers/time_slots_controller.rb

SELECT * FROM "time_slots" WHERE (week_of = 'Dec 7 2009')
---
  def index
    @time_slots = TimeSlot.all if (params[:week_of].nil?)

SELECT * FROM "time_slots" WHERE ("time_slots"."id" = 1)
---
  def show
    @time_slot = TimeSlot.find(params[:id])

SELECT * FROM "time_slots" WHERE ("time_slots"."id" = 1)
---
  def edit
    @time_slot = TimeSlot.find(params[:id])

INSERT INTO "time_slots" ("created_at", "updated_at", "week_of", "full_name", "time_slot", "workout_type") VALUES('2009-12-14 05:16:13', '2009-12-14 05:16:13', 'dec72009', 'John Wright', 'mon_7am', 'regular')
---
  def create
    @time_slot = TimeSlot.new
    @time_slot.week_of = params[:week_of]
    @time_slot.full_name = params[:full_name]
    @time_slot.workout_type = params[:workout_type]
    @time_slot.time_slot = params[:time_slot]


    respond_to do |format|
      if @time_slot.save

SELECT * FROM "time_slots" WHERE ("time_slots"."id" = 1)
UPDATE "time_slots" SET "updated_at" = '2009-12-14 05:16:21', "week_of" = 'ec72009' WHERE "id" = 1
---
  def update
    @time_slot = TimeSlot.find(params[:id])

    respond_to do |format|
      if @time_slot.update_attributes(params[:time_slot])

SELECT * FROM "time_slots" WHERE ("time_slots"."id" = 2)
DELETE FROM "time_slots" WHERE "id" = 2
---
  def destroy
    @time_slot = TimeSlot.find(params[:id])
    @time_slot.destroy